Revit 2024 API
LineSegment.StartParameter Property
 Parameter associated with the start point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double StartParameter { get; }
Visual Basic
Public ReadOnly Property StartParameter As Double
	Get
Visual C++
public:
property double StartParameter {
	double get ();
}
See Also
LineSegment Class
Autodesk.Revit.DB Namespace